cases/pipe-lens-memb-spring/fluid/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2512                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

9
(
    inlet
    {
        type            patch;
        nFaces          200;
        startFace       34768;
    }
    outlet
    {
        type            patch;
        nFaces          200;
        startFace       34968;
    }
    interface_upstream
    {
        type            wall;
        inGroups        1(wall);
        nFaces          120;
        startFace       35168;
    }
    interface_downstream
    {
        type            wall;
        inGroups        1(wall);
        nFaces          120;
        startFace       35288;
    }
    lensRim
    {
        type            wall;
        inGroups        1(wall);
        nFaces          40;
        startFace       35408;
    }
    wallInner
    {
        type            wall;
        inGroups        1(wall);
        nFaces          600;
        startFace       35448;
    }
    wallOuter
    {
        type            wall;
        inGroups        1(wall);
        nFaces          640;
        startFace       36048;
    }
    symmetry_z
    {
        type            symmetryPlane;
        inGroups        1(symmetryPlane);
        nFaces          1232;
        startFace       36688;
    }
    symmetry_y
    {
        type            symmetryPlane;
        inGroups        1(symmetryPlane);
        nFaces          1232;
        startFace       37920;
    }
)

// ************************************************************************* //
