cases/pipe-lens-memb-spring/fluid/constant/turbulenceProperties
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      turbulenceProperties;
}

// Laminar flow — Re is very low in the zonula (quasi-static IOP-driven regime).

simulationType  laminar;
