cases/pipe-lens-memb-spring/fluid/system/preciceDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      preciceDict;
}

// preCICE adapter configuration for the FLUID participant (pimpleFoam).
// Exchanges: writes Force, reads Displacement at the two FSI patches.

participant   Fluid;

preciceConfig "../precice-config.xml";

modules ( FSI );

interfaces
{
    Interface1
    {
        mesh          Fluid-Mesh;

        // Both axial faces of the lens disc are FSI interfaces.
        patches       ( interface_upstream interface_downstream );

        locations     faceCenters;

        // Fluid → Solid : viscous + pressure forces on the disc faces
        writeData     ( Force );

        // Solid → Fluid : displacement of disc faces (for ALE mesh motion)
        readData      ( Displacement );
    }
}

FSI
{
    solverType      incompressible;
    rho             rho [1 -3 0 0 0 0 0] 1000;
}
